/*Даалгавар 3. Валют хөрвүүлэгч
Аялалд гарахаасаа өмнө төгрөгөө доллар руу хөрвүүлж, буцаж ирээд үлдсэн долларыг
төгрөг рүү хөрвүүлэх хэрэгтэй боллоо. Ханш: 1$ = 3450₮.
Шаардлага
1. Төгрөгийг доллар руу хөрвүүлдэг float to_usd(float mnt) функц бич.
2. Долларыг төгрөг рүү хөрвүүлдэг float to_mnt(float usd) функц бич.
3. main() дотор эхлээд төгрөгийн дүн асууж долларт хөрвүүл, дараа нь долларын дүн
асууж төгрөгт хөрвүүл.
4. Хариуг таслалаас хойш 2 оронтой хэвлэ: %.2f
Жишээ
Функцийн дуудлага Хүлээгдэж буй үр дүн
to_usd(34500) 10.00
to_usd(5000) 1.45
to_mnt(20) 69000.00
Зөвлөмж: Ханшийг программын эхэнд #define RATE 3450.0 гэж нэг удаа бичээд хоёр
функцдээ ашигла. Ханш өөрчлөгдвөл ганцхан газар засна!*/
#include<stdio.h>
#define RATE 3450.0

float to_usd(float mnt)
{
    return mnt/RATE;
}

float to_mnt(float usd) {
    return usd * RATE;
}

int main()
{
float mnt,usd;
    printf("mnt");
    scanf("%f",&mnt);
    printf("usd");
    scanf("%f",&usd);
    printf("\nUSD -> MNT: %.2f, MNT -> USD: %.2f\n", to_mnt(usd), to_usd(mnt));
  return 0;
}
