/*Даалгавар 1. Хаалганы хонх
Хаалганы хонхны товчийг дарахад «Din-don!» гэж дуугардаг. Хонх юу ч буцааж өгдөггүй,
зүгээр л дуугардаг. Ийм функцийг C хэлэнд void гэдэг.
Шаардлага
1. Дэлгэцэнд Din-don! гэж хэвлэдэг void bell() функц бич.
2. Дэлгэцэнд ---------- гэсэн зураас хэвлэдэг void line() функц бич.
3. main() дотроос bell() ба line() функцуудыг ээлжлэн 3 удаа дууд (доорх гаралт шиг).
Хүлээгдэж буй гаралт
Din-don!
----------
Din-don!
----------
Din-don!
----------
Зөвлөмж: void функцэд return бичих шаардлагагүй. Дуудахдаа хаалт ба цэгтэй таслалыг
мартуузай: bell()*/ 
#include<stdio.h>          
       
   void bell()
{
    printf("Din_don!\n");
}
   void line()
 {
    printf("----------\n");
}
int main()
{
    int i;
     for(i=0;i<3;i++) 
     {
        bell();
        line();
     }
    return 0;
}