/*Даалгавар 4. Хамгийн их оноо
Гурван найз сагсан бөмбөгийн шидэлтийн тэмцээн хийлээ. Хэн хамгийн их оноо авсныг олох
программ хэрэгтэй.
Шаардлага
1. Хоёр тооны ихийг буцаадаг int max2(int a, int b) функц бич (if ашигла).
2. Гурван тооны хамгийн ихийг буцаадаг int max3(int a, int b, int c) функц бич.
3. Нөхцөл: max3 дотор if бичихгүй, зөвхөн max2 функцийг дуудаж ашигла.
4. main() дотор гурван оноог scanf-аар уншаад, хамгийн ихийг хэвлэ.
Жишээ
Функцийн дуудлага Хүлээгдэж буй үр дүн
max2(7, 12) 12
max2(9, 9) 9
max3(8, 15, 11) 15
max3(20, 3, 17) 20
Зөвлөмж: Эхлээд a, b хоёрын ихийг ол, дараа нь тэр үр дүнг c-тэй харьцуул. Нэг
функцийн гаралт нөгөө функцийн оролт болж болно. Яг мах татагчаас гарсан мах буузны
орц болдог шиг!*/
#include<stdio.h>
int main()
{
    int i,sum=0,s=1;
    int max2;
for(i=1;i<=s;i++)
{
   sum=sum+i;
   s=s*i;
}
printf("Sum: %d\n", sum);
printf("S: %d\n", s);
}

double find_max(int n)
{
int i;
double a, max2;
for(i=1;i<=n;i++)
{
scanf("%lf", &a);
if(i==1) max2=a;
if(a>max2)
max2=a;
}
return max2;

}