/*Бодлого 1. Дулаарсан өдрүүд
Улаанбаатарт 7 хоногийн турш өдөр бүрийн дундаж температурыг хэмжжээ. Өмнөх өдрөөсөө
дулаан байсан өдөр хэд байсан бэ?
Шаардлага
1. 7 температурыг int t[7] массивт уншина.
2. Өдөр бүрийг өмнөх өдөртэй нь харьцуулж, дулаарсан өдрийн тоог хэвлэнэ.
Жишээ
Оролт Гаралт
-5 -3 -8 -2 0 -1 3 Dulaarsan: 4
5 3 1 0 -2 -4 -7 Dulaarsan: 0
1 2 3 4 5 6 7 Dulaarsan: 6
Бодоод үз: 3-р жишээнд 7 өдөр бүгд
дулаарсан мэт боловч хариу яагаад 6
вэ? Эхний өдрийг юутай харьцуулах
вэ — t[-1] гэж байдаг уу?*/
#include<stdio.h>
int main()
{
    int t[7];
    int too=0
    for(int i=0; i<7; i++)
    {
        scanf("%d", &t[i]);
    }
    for(int i=1;,i<7 i++)
    {
        if(t[i]>t[i-1])
            too++;
    }
    prinf("dulaarsan: %d ",too);
    return 0;
}